/***************************************************************************************
**文件名:     HAL_OnChipFlash.c
**版本:       V1.00
**说明:       此文件可以根据实际情况修改。
**修改记录:   
*版本:V1.00     
*修改者:hhx    
*时间:
*修改说明：                    
创建了这个文件
**备注:      
****************************************************************************************/
#include "HAL_OnChipFlash.h"
#include "DRV_OnChipFlash.h"

#if  HAL_ONCHIP_FLASH_MODULE_EN
#warning HAL_ONCHIP_FLASH模块使能!
/*******************************宏定义***************************/  

/*************************.C变量结构声明***********************/  

/*************************私有全局变量*************************/  

/*************************公共全局变量*************************/  

/*************************局部函数*****************************/  


/*************************全局函数****************************/  
/***************************************************************************************
**函数名:       HAL_OnChipFlash_Init
**功能描述:     片内FLASH初始化
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_OnChipFlash_Init(void)
{
    DRV_OnChipFlash_Init();
}
/***************************************************************************************
**函数名:       HAL_OnChipFlash_EraseBytes
**功能描述:     flash扇区擦除
**输入参数:     
addr  所擦除扇区内的起始地址
size  所擦除扇区内的数据大小
**输出参数:     
TRUE：成功   
FALSE：失败
**备注:         
****************************************************************************************/
UINT8 HAL_OnChipFlash_EraseBytes(UINT32 addr,UINT32 size)
{
	return DRV_OnChipFlash_EraseBytes( addr, size);
}


/***************************************************************************************
**函数名:       HAL_OnChipFlash_Write
**功能描述:     EFLASH任意地址写数据
**输入参数:     
addr: FLASH地址
des:  word数据指针
len:  word数据长度
**输出参数:     
TRUE：编程成功   
FALSE：编程失败
**备注:         
****************************************************************************************/
UINT8 HAL_OnChipFlash_Write(UINT32 flash_addr, const UINT8* ram_addr, UINT32 len)
{
	return DRV_OnChipFlash_Write( flash_addr,  ram_addr,  len);
}

/***************************************************************************************
**函数名:       HAL_OnChipFlash_CheckSum
**功能描述:     校验
**输入参数:     
Addr 地址
ByteLength 字节长度
**输出参数:     --
**备注:         
****************************************************************************************/
UINT32 HAL_OnChipFlash_CheckSum(UINT32 Addr, UINT32 ByteLength)
{
	return DRV_OnChipFlash_CheckSum( Addr,  ByteLength);
}

/***************************************************************************************
**函数名:       HAL_OnChipFlash_ReadNWords
**功能描述:     word编程
**输入参数:     
addr: FLASH地址
des:  word数据指针
len:  word数据长度
**输出参数:     
TRUE：编程成功   
FALSE：编程失败
**备注:         
****************************************************************************************/
void HAL_OnChipFlash_ReadNWords(UINT32 addr, UINT32 *des, UINT32 len)
{
	DRV_OnChipFlash_ReadNWords( addr,  des,  len);
}
/***************************************************************************************
**函数名:       HAL_OnChipFlash_WirteNWords
**功能描述:     word编程
**输入参数:     
addr: 要编程的EFLASH地址
des:  编程的word数据指针
len:  要编程的word数据长度
**输出参数:     
TRUE：编程成功   
FALSE：编程失败
**备注:         
****************************************************************************************/
UINT8 HAL_OnChipFlash_WirteNWords(UINT32 addr, UINT32 *des, UINT32 len)
{
	return DRV_OnChipFlash_WirteNWords(addr,  des,  len);
}

/***************************************************************************************
**函数名:       HAL_OnChipFlash_ReadBytes
**功能描述:     从EFLASH目标地址读取长度为len的Bytes数据
**输入参数:     
Addr 地址
des 数据缓冲
len 字节长度
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_OnChipFlash_ReadBytes(UINT32 addr, UINT8 *des, UINT32 len)
{
	DRV_OnChipFlash_ReadBytes( addr, des, len);
}
#endif  /*HAL_ONCHIP_FLASH_MODULE_EN*/
/************************************Code End******************************************/
