/***************************************************************************************
**文件名:     HAL_BreathingLight.c
**版本:       V1.00
**说明:       此文件可以根据实际情况修改。
**修改记录:   
*版本:V1.00     
*修改者:hhx    
*时间:
*修改说明：                    
创建了这个文件
**备注:      
****************************************************************************************/
#include "HAL_BreathingLight.h"
#if  HAL_BREATHING_LIGHT_MODULE_EN
#warning HAL_BREATHING_LIGHT模块使能!
/*******************************宏定义***************************/  
#define HAL_BREATHING_LIGHT_RUN_TIME_MAX			(10)	
/*************************.C变量结构声明***********************/  
typedef struct
{
    INT32U runTime;							//运行时间 
} TYPEs_BreathingLightCtrl;
/*************************私有全局变量*************************/  
static TYPEs_BreathingLightCtrl breathingLightCtrl =
{
	.runTime = 0,
};
/*************************公共全局变量*************************/  


/*************************局部函数*****************************/  


/*************************全局函数****************************/  
/***************************************************************************************
**函数名:       HAL_BreathingLightRed
**功能描述:     开启红色的呼吸灯
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_BreathingLightRed(void)
{
	rgb_control(RED);
}
/***************************************************************************************
**函数名:       HAL_BreathingLightBlue
**功能描述:     开启蓝色的呼吸灯
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_BreathingLightBlue(void)
{
	rgb_control(BLUE);	
}

/***************************************************************************************
**函数名:       HAL_BreathingLightGreen
**功能描述:     开启绿色的呼吸灯
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_BreathingLightGreen(void)
{
	rgb_control(GREEN);	
}
/***************************************************************************************
**函数名:       HAL_BreathingLightGreen
**功能描述:     关闭呼吸灯
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_BreathingLightOff(void)
{
	rgb_control(OFF);	
}

/***************************************************************************************
**函数名:       HAL_BreathingLightDeal
**功能描述:     呼吸灯处理程序
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_BreathingLightDeal(void)
{
	breathingLightCtrl.runTime ++;
	if (breathingLightCtrl.runTime < HAL_BREATHING_LIGHT_RUN_TIME_MAX)
	{
		return;
	}
	breathingLightCtrl.runTime = 0;
    DRV_BreathingLightDeal();
}

#endif  /*HAL_BREATHING_LIGHT_MODULE_EN*/
/************************************Code End******************************************/