/***************************************************************************************
**文件名:     HAL_KeySacn.c
**版本:       V1.00
**说明:       此文件可以根据实际情况修改。
**修改记录:   
*版本:V1.00     
*修改者:hhx    
*时间:
*修改说明：                    
创建了这个文件
**备注:      
****************************************************************************************/
#include "HAL_KeySacn.h"
#include "DRV_KeySacn.h"
#if  HAL_KEY_SCAN_MODULE_EN
#warning HAL_KEY_SCAN模块使能!
/*******************************宏定义***************************/  
#define HAL_KEY_SCAN_FILT_TIME              (2)     //过滤时间
/*************************.C变量结构声明***********************/  
typedef struct
{
    volatile INT8U isrFlag;                  //中断产生中断标志位0,无中断；1，有中断
} TYPEs_KeyCtrl;
/*************************私有全局变量*************************/  
static TYPEs_KeyCtrl KeyCtrl=
{
    .isrFlag =0,
};
/*************************公共全局变量*************************/  


/*************************局部函数*****************************/  


/*************************全局函数****************************/  
/***************************************************************************************
**函数名:       HAL_KeySacnInit
**功能描述:     按键初始化
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_KeySacnInit(void)
{
    DRV_KeySacn_Init();
}
/***************************************************************************************
**函数名:       HAL_KeySacnIsrFlagSet
**功能描述:     中断标志位置
**输入参数:     --
**输出参数:     --
**备注:         这个需要放到中断服务程序里面。
****************************************************************************************/
void HAL_KeySacnIsrFlagSet(void)
{
	if (0 == KeyCtrl.isrFlag)
    {
        KeyCtrl.isrFlag = 1;
    }
}
/***************************************************************************************
**函数名:       HAL_KeySacnIsrFlagClear
**功能描述:     中断标志清除
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_KeySacnIsrFlagClear(void)
{
    KeyCtrl.isrFlag = 0;
}
/***************************************************************************************
**函数名:       HAL_KeySacnGet
**功能描述:     获取按键的键盘值
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
INT8U HAL_KeySacnGet(void)
{
   return DRV_KeySacn_GetValue();
}

/***************************************************************************************
**函数名:       HAL_KeySacn_EnterSleepConfig
**功能描述:     按键进入休眠初始化
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_KeySacn_EnterSleepConfig(void)
{
	DRV_KeySacn_EnterSleepConfig();
}
#endif  /*HAL_KEY_SCAN_MODULE_EN*/
/************************************Code End******************************************/
