/***************************************************************************************
**文件名:     HAL_Adc.c
**版本:       V1.00
**说明:       此文件可以根据实际情况修改。
**修改记录:   
*版本:V1.00     
*修改者:hhx    
*时间:
*修改说明：                    
创建了这个文件
**备注:      
****************************************************************************************/
#include "HAL_Adc.h"
#include "DRV_Adc.h"
#if HAL_ADC_MODULE_EN
#warning HAL_ADC模块使能!
/*******************************宏定义***************************/
#define HAL_ADC_MULTIPLE1 (56.0 / 256)  //处理时的倍数
#define HAL_ADC_VOLTAGE_CORRECTION1 (13) //电压补偿
#define HAL_ADC_MULTIPLE2 (56.0 / 112)  //处理时的倍数
#define HAL_ADC_VOLTAGE_CORRECTION2 (13) //电压补偿
#define HAL_ADC_DELAY_MS(X) DelayMS(X) //延迟
/*************************.C变量结构声明***********************/

/*************************私有全局变量*************************/

/*************************公共全局变量*************************/

/*************************局部函数*****************************/

/*************************全局函数****************************/
/***************************************************************************************
**函数名:       HAL_Adc_Init
**功能描述:     ADC初始化
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_Adc_Init(void)
{
    DRV_Adc_Init();
}
/***************************************************************************************
**函数名:       --
**功能描述:     --
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_Adc_MsSw(TYPEe_AdcSw sw)
{
    if (eAdcSwOpen == sw)
    {
        DRV_Adc_MsSw(1);
    }
    else
    {
        DRV_Adc_MsSw(0);
    }
}
/***************************************************************************************
**函数名:       HAL_Adc_Conversion
**功能描述:     ADC转换处理
**输入参数:     
uint16_t *upBat, 上方电池
uint16_t *downBat 下方电池
端口信息
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_Adc_Conversion(uint16_t *upBat,uint16_t *downBat)
{
    uint16_t results = 0;
	HAL_Adc_MsSw(eAdcSwOpen);
	HAL_ADC_DELAY_MS(100); //开启后延迟一下保证电源稳定

	results = DRV_Adc_Conversion(DRV_ADCCH_0);
	results = (uint16_t)(results / HAL_ADC_MULTIPLE1);
	results += HAL_ADC_VOLTAGE_CORRECTION1;
	*upBat = results;

	results = DRV_Adc_Conversion(DRV_ADCCH_1);
	results = (uint16_t)(results / HAL_ADC_MULTIPLE2);
	results += HAL_ADC_VOLTAGE_CORRECTION2;
	*downBat = results;
	HAL_Adc_MsSw(eAdcSwClose);
}
/***************************************************************************************
**函数名:       HAL_Adc_EnterSleepConfig
**功能描述:     进入休眠
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void HAL_Adc_EnterSleepConfig(void)
{
    DRV_Adc_EnterSleepConfig();
}

#endif /*HAL_ADC_MODULE_EN*/
       /************************************Code End******************************************/