/***************************************************************************************
**文件名:     DRV_I2C.c
**版本:       V1.00
**说明:       此文件可以根据实际情况修改。
**修改记录:   
*版本:V1.00     
*修改者:hhx    
*时间:
*修改说明：                    
创建了这个文件
**备注:      
****************************************************************************************/
#include "DRV_I2C.h"
#if  DRV_I2C_MODULE_EN
#warning DRV_I2C模块使能!
/*******************************宏定义***************************/  

/*************************.C变量结构声明***********************/  

/*************************私有全局变量*************************/  

/*************************公共全局变量*************************/  

/*************************局部函数*****************************/  


/*************************全局函数****************************/  
/***************************************************************************************
**函数名:       DRV_I2C_Delayus
**功能描述:     粗略延时
**输入参数:     INT8U u8_us，延时时间
**输出参数:     --
**备注:         
****************************************************************************************/
static void DRV_I2C_Delayus(INT8U us)
{
	DelayUS(us);
}
/***************************************************************************************
**函数名:       DRV_I2C_Start
**功能描述:     DRV_I2C开始
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
static void DRV_I2C_Start(void)
{    
        M_SDA_OUT_PP();
        M_SCL_OUT_PP();        //设置方向
    
    M_SDA_OUT_1();//需在SCL之前设定
    M_SCL_OUT_1();//硬件进入SDA检测状态
    DRV_I2C_Delayus(5);//延时至少4.7us
    M_SDA_OUT_0();//SDA由1->0,产生开始信号
    DRV_I2C_Delayus(5);//延时至少4us
    M_SCL_OUT_0();//SCL变为无效
    DRV_I2C_Delayus(5);//延时至少4us //by hx 2018.05.11
}
/***************************************************************************************
**函数名:       DRV_I2C_Stop
**功能描述:     DRV_I2C停止
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
static void DRV_I2C_Stop(void)
{
    M_SDA_OUT_PP();
    M_SCL_OUT_PP();
    
    M_SDA_OUT_0();//在SCL之前拉低
    M_SCL_OUT_1();//硬件进入SDA检测状态
    DRV_I2C_Delayus(5);//至少延时4us
    M_SDA_OUT_1();//SDA由0->1,产生结束信号
    DRV_I2C_Delayus(5);//延时至少4.7us
}
/***************************************************************************************
**函数名:       DRV_I2C_SendAck
**功能描述:     DRV_I2C发送响应
**输入参数:     BOOLEAN b_BitAck 0,响应；1，不响应
**输出参数:     --
**备注:         
****************************************************************************************/
static void DRV_I2C_SendAck(BOOLEAN b_BitAck)
{
    M_SDA_OUT_PP();
    M_SCL_OUT_PP();
    
    if (M_TRUE == b_BitAck)
    {
        M_SDA_OUT_1();
    }
    else
    {
        M_SDA_OUT_0();
    }
    M_SCL_OUT_1();//发送应答信号
    DRV_I2C_Delayus(5);//延时至少4us
    M_SCL_OUT_0();//整个期间保持应答信号
}
/***************************************************************************************
**函数名:       DRV_I2C_Wait_Ack
**功能描述:     DRV_I2C等待响应
**输入参数:     --
**输出参数:     0 有ACK信号，1无ACK信号
**备注:         
****************************************************************************************/
static INT8U DRV_I2C_Wait_Ack(void)
{
    M_SDA_IN_IPU(); //将输出改成输入
    M_SCL_OUT_PP();
    
    M_SCL_OUT_1();//进入应答检测
    DRV_I2C_Delayus(5); //至少延时4us


    if(1 == M_SDA_READIN())
    {
        M_SCL_OUT_0();
        return 1;
    }


    M_SCL_OUT_0();
    return 0;   
}
/***************************************************************************************
**函数名:       DRV_I2C_WriteByte
**功能描述:     DRV_I2C发送一个字节数据
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
static void DRV_I2C_WriteByte(INT8U u8_Data)
{
    INT8U i;
    M_SDA_OUT_PP();
    M_SCL_OUT_PP();
    
    for(i = 8; i > 0; i--)
    {
        if(0x80 == (u8_Data & 0x80))//从MSb开始逐位写入
        {
            M_SDA_OUT_1();
        }
        else
        {
            M_SDA_OUT_0();
        }
        M_SCL_OUT_1();
        DRV_I2C_Delayus(5);//延时至少4us
        M_SCL_OUT_0();
        u8_Data <<= 1;//低位向高位移动
        DRV_I2C_Delayus(5);
    }
}
/***************************************************************************************
**函数名:       DRV_I2C_ReadByte
**功能描述:     DRV_I2C读取一个字节
**输入参数:     --
**输出参数:     读取一个字节
**备注:         
****************************************************************************************/
static INT8U DRV_I2C_ReadByte(void)
{
    INT8U u8_i;
    INT8U u8_data = 0;


    M_SDA_IN_IPU();//将输出改成输入
    M_SCL_OUT_PP();
    
    for (u8_i = 8; u8_i > 0; u8_i--)
    {
        M_SCL_OUT_1();
        DRV_I2C_Delayus(5);//延时至少4us
        u8_data <<= 1;
        if (0 != M_SDA_READIN())
        {
            u8_data |= 0x01;
        }
        M_SCL_OUT_0();
        DRV_I2C_Delayus(5);
    }
    
    return u8_data;
}
/***************************************************************************************
**函数名:       DRV_I2C_WriteNByte
**功能描述:     发送N个字节
**输入参数:     
INT8U i2cAddr,芯片地址
INT8U addr, 寄存器地址
INT8U *data,数据指针
INT8U len
数据
**输出参数:     M_TRUE-成功，M_FALSE-失败
**备注:         
****************************************************************************************/
INT8U DRV_I2C_WriteNByte(INT8U i2cAddr,INT8U addr, INT8U *data,INT32U len)
{   
    DRV_I2C_Start();//发送起始位
    DRV_I2C_WriteByte(i2cAddr);//发送器件地址
    DRV_I2C_Wait_Ack();
    DRV_I2C_WriteByte(addr);//发送器件地址
    DRV_I2C_Wait_Ack();
	while(len --)
	{
		DRV_I2C_WriteByte(*data);//发送器件地址
		data++;
		DRV_I2C_Wait_Ack();
	}
    DRV_I2C_Stop();
    return M_TRUE;
}
/***************************************************************************************
**函数名:       DRV_I2C_ReadNByte
**功能描述:     读N个字节数据
**输入参数:     
INT8U u8_Addr,
地址
**输出参数:     
INT8U
**备注:         
****************************************************************************************/
INT8U DRV_I2C_ReadNByte(INT8U i2cAddr,INT8U addr, INT8U *data,INT32U len)
{
    INT8U u8_Buffer = 0;


    DRV_I2C_Start();//发送起始位
    DRV_I2C_WriteByte(i2cAddr);//发送器件地址
    DRV_I2C_Wait_Ack();
    DRV_I2C_WriteByte(addr);//发送器件地址
    DRV_I2C_Wait_Ack();
    DRV_I2C_Start();//发送起始位
    DRV_I2C_WriteByte(i2cAddr + 0x01);//发送器件地址
    DRV_I2C_Wait_Ack();
	while(len)
	{
		*data = DRV_I2C_ReadByte();
		data ++;
		len --;
		if(0 == len)
		{
			DRV_I2C_SendAck(M_TRUE); //最后一个数据不应答 
		}
		else
		{
			DRV_I2C_SendAck(M_FALSE); //应答
		}
	}
    
    DRV_I2C_Stop();
    
    return 0;
}
#endif  /*DRV_I2C_MODULE_EN*/
/************************************Code End******************************************/