/***************************************************************************************
**文件名:     DRV_SysTimer.c
**版本:       V1.00
**说明:       此文件可以根据实际情况修改。
**修改记录:   
*版本:V1.00     
*修改者:hhx    
*时间:
*修改说明：                    
创建了这个文件
**备注:      
****************************************************************************************/
#include "DRV_SysTimer.h"
/**********以下是国芯提供的头文件**********/
#include "sys.h"
#include "delay.h"
#include "debug.h"
#include "systick_drv.h"
#include "systick_demo.h"

#if  DRV_SYS_TIMER_MODULE_EN
#warning DRV_SYS_TIMER模块使能!
/*******************************宏定义***************************/  
#define TIMEOUT_VALUE					1000 
/*************************.C变量结构声明***********************/  

/*************************私有全局变量*************************/  
static sysTimerHandler_t sysTimerHandler = NULL;
/*************************公共全局变量*************************/  


/*************************局部函数*****************************/  


/*************************全局函数****************************/  
/***************************************************************************************
**函数名:       DRV_SysTimerHandler
**功能描述:     系统时钟定时器回调函数
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void DRV_SysTimerHandler(void)
{
    if (NULL != sysTimerHandler)
    {
        sysTimerHandler();
    }
}

/***************************************************************************************
**函数名:       DRV_SysTimerHandlerReg
**功能描述:     回调函数注册
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
INT8S DRV_SysTimerHandlerReg(sysTimerHandler_t pfun)
{
    if ( NULL != pfun)		//这里需要保证指针不为空
    {
        sysTimerHandler = pfun;
        return 0;
    }
    return -1;
}
/***************************************************************************************
**函数名:       DRV_SysTimerInit
**功能描述:     定时器初始化
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void DRV_SysTimerInit(void)
{
	SysTick_Config(g_sys_clk/1000);  //1ms
	SysTick_Enable(TRUE);
}
/***************************************************************************************
**函数名:       DRV_SysTimerClose
**功能描述:     关闭定时器
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void DRV_SysTimerClose(void)
{
	SysTick_Enable(FALSE);
}

#endif  /*DRV_SYS_TIMER_MODULE_EN*/
/************************************Code End******************************************/
