/***************************************************************************************
**文件名:     DRV_MBI5024.c
**版本:       V1.00
**说明:       此文件可以根据实际情况修改。
**修改记录:   
*版本:V1.00     
*修改者:hhx    
*时间:
*修改说明：                    
创建了这个文件
**备注:      
****************************************************************************************/
#include "DRV_MBI5024.h"
#include "DRV_KeySacn.h"
#if DRV_MBI5024_MODULE_EN
#warning DRV_MBI5024模块使能!
/*******************************宏定义***************************/
#define DRV_MBI5024_Delay(X) delay(X)
//#define DRV_MBI5024_DELAY_TIME1 500
//#define DRV_MBI5024_DELAY_TIME2 200
#define DRV_MBI5024_DELAY_TIME1 160
#define DRV_MBI5024_DELAY_TIME2 80
//#define DRV_MBI5024_DELAY_TIME1 1600
//#define DRV_MBI5024_DELAY_TIME2 800
//#define DRV_MBI5024_DELAY_TIME1 16000
//#define DRV_MBI5024_DELAY_TIME2 8000
/*************************.C变量结构声明***********************/

/*************************私有全局变量*************************/

/*************************公共全局变量*************************/

/*************************局部函数*****************************/
/***************************************************************************************
**函数名:       DRV_MBI5024_LEDInit
**功能描述:     另外的接的LED
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
static void DRV_MBI5024_LEDInit(void)
{
	M_LED_B_PWM_OUT_PP();
	M_LED_B_PWM_OUT_1();
}
/*************************全局函数****************************/

/***************************************************************************************
**函数名:       DRV_MBI5024_LEDClose
**功能描述:     另外的接的LED关闭
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void DRV_MBI5024_LEDClose(void)
{
	M_LED_B_PWM_OUT_1();
}
/***************************************************************************************
**函数名:       DRV_MBI5024_LED_Init
**功能描述:     另外的接的LED 开启
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void DRV_MBI5024_LEDOpen(void)
{
	M_LED_B_PWM_OUT_0();
}
/***************************************************************************************
**函数名:       DRV_MBI5024_Init
**功能描述:     MBI5024初始化
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void DRV_MBI5024_Init(void)
{
    M_MBI5024_POW_OUT_PP();
    M_MBI5024_CLK_OUT_PP();
    M_MBI5024_SDI_OUT_PP();
    M_MBI5024_LE_OUT_PP();
	M_MBI5024_POW_OUT_0();
	DelayMS(200); //等待芯片上电稳定
	DRV_MBI5024_Out(0,1);
	DRV_MBI5024_LEDInit();
}
/***************************************************************************************
**函数名:       DRV_MBI5024_Out
**功能描述:     输出信号
**输入参数:     
u16 dat, // 数据s
u8 enable //0 关闭 非0开启
**输出参数:     --
**备注:         
****************************************************************************************/
void DRV_MBI5024_Out(u16 dat, u8 enable)
{

    u16 i;
    M_MBI5024_POW_OUT_PP();
    M_MBI5024_CLK_OUT_PP();
    M_MBI5024_SDI_OUT_PP();
    M_MBI5024_LE_OUT_PP();
//    M_MBI5024_POW_OUT_0();
    M_MBI5024_CLK_OUT_0();
    M_MBI5024_SDI_OUT_0();
    M_MBI5024_LE_OUT_0(); //PS.LE是低电，资料会被锁主。一定要拉低！
    if (0 == enable)
    {
        M_MBI5024_CLK_OUT_1();
        DRV_MBI5024_Delay(DRV_MBI5024_DELAY_TIME1);
        M_MBI5024_CLK_OUT_0();
//        M_MBI5024_POW_OUT_1();
        M_MBI5024_LE_OUT_0();
        M_MBI5024_SDI_OUT_0();
    }
    else
    {
//        M_MBI5024_POW_OUT_0(); //给模块上电
                               //		DRV_MBI5024_Delay(1000);
        for (i = 0; i < 16; i++)
        {
            M_MBI5024_CLK_OUT_0();
            DRV_MBI5024_Delay(DRV_MBI5024_DELAY_TIME2);
            if (dat & 0x8000)
            {
                M_MBI5024_SDI_OUT_1();
            }
            else
            {
                M_MBI5024_SDI_OUT_0();
            }
            dat <<= 1;
            DRV_MBI5024_Delay(DRV_MBI5024_DELAY_TIME2);
            M_MBI5024_CLK_OUT_1();
            DRV_MBI5024_Delay(DRV_MBI5024_DELAY_TIME1);
        }
        DRV_MBI5024_Delay(DRV_MBI5024_DELAY_TIME2);
        M_MBI5024_LE_OUT_1();
        DRV_MBI5024_Delay(DRV_MBI5024_DELAY_TIME2);
        M_MBI5024_LE_OUT_0();
        DRV_MBI5024_Delay(DRV_MBI5024_DELAY_TIME1);
    }
}
/***************************************************************************************
**函数名:       DRV_MBI5024_EnterSleepConfig
**功能描述:     输出信号
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void DRV_MBI5024_EnterSleepConfig(void)
{
    M_MBI5024_POW_OUT_PP();
    M_MBI5024_POW_OUT_1();
    M_MBI5024_CLK_OUT_PP();
    M_MBI5024_CLK_OUT_0();
    M_MBI5024_SDI_OUT_PP();
    M_MBI5024_SDI_OUT_0();
    M_MBI5024_LE_OUT_PP();
    M_MBI5024_LE_OUT_0();
    M_LED_B_PWM_OUT_PP();
    M_LED_B_PWM_OUT_1();
    DRV_MBI5024_SysStatusSet(3);
}
/***************************************************************************************
**函数名:       DRV_MBI5024_SysStatusSet
**功能描述:     系统灯
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
uint8_t DRV_MBI5024_SysStatusSet(uint8_t dat)
{
    #if 1
    return 1;
    #else
    return DRV_KeySacn_PwmOut(dat);
    #endif
}
#endif /*DRV_MBI5024_MODULE_EN*/
/************************************Code End******************************************/
