/***************************************************************************************
**文件名:     DRV_Alarm.c
**版本:       V1.00
**说明:       此文件可以根据实际情况修改。
**修改记录:   
*版本:V1.00     
*修改者:hhx    
*时间:
*修改说明：                    
创建了这个文件
**备注:      
****************************************************************************************/
#include "DRV_Alarm.h"
#if DRV_ALARM_MODULE_EN
#warning DRV_ALARM模块使能!
/*******************************宏定义***************************/
#define DRV_ALARM_FILTER_TIME (10)
/*************************.C变量结构声明***********************/
typedef struct
{
	uint8_t pre;
	uint32_t cnt;
} TYPEs_Filter;
/*************************私有全局变量*************************/

/*************************公共全局变量*************************/

/*************************局部函数*****************************/
static TYPEs_Filter filter = {
	.pre = 0,
	.cnt = 0,
};
/*************************全局函数****************************/
AlarmIntHandler_t AlarmIntHandler = NULL; //中断指针
/***************************************************************************************
**函数名:       DRV_Alarm_SetWakeUp
**功能描述:     io配置
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void DRV_Alarm_SetWakeUp(void)
{
	M_ALARM_IN_NOPULL();
	M_ALARM_EXIT_EDGE_DISABLE();
}
/***************************************************************************************
**函数名:       DRV_Alarm_SetInterrpt
**功能描述:     io配置 带有中断
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void DRV_Alarm_SetInterrpt(void)
{
	M_ALARM_IN_NOPULL();
	M_ALARM_EXIT_EDGE_ENABLE();
}

/***************************************************************************************
**函数名:       DRV_Alarm_InterrptService
**功能描述:     中断服务程序
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
void DRV_Alarm_InterrptService(EPORT_PINx pin)
{
	if (M_ALARM_PIN == pin)
	{
		if (Bit_RESET == M_ALARM_READIN())
		{
			if (NULL != AlarmIntHandler)
			{
				AlarmIntHandler();
			}
		}
	}
}
/***************************************************************************************
**函数名:       DRV_Alarm_GetStatus
**功能描述:     报警获取状态
**输入参数:     --
**输出参数:     
int8_t
0、低电平
1、高电平
-1 滤波中
**备注:         
****************************************************************************************/
int8_t DRV_Alarm_GetStatus(void)
{
	uint8_t tmp = M_ALARM_READIN();
	if (tmp == filter.pre)
	{
		if (0 != filter.cnt)
		{
			filter.cnt--;
		}
		else
		{
			return tmp;
		}
	}
	else
	{
		filter.cnt = DRV_ALARM_FILTER_TIME;
		filter.pre = tmp;
	}
	return -1;
}

#endif /*DRV_ALARM_MODULE_EN*/
	   /************************************Code End******************************************/