/***************************************************************************************
**文件名:     MyConfig.c
**版本:       V1.00
**说明:       此文件可以根据实际情况修改。
**修改记录:   
*版本:V1.00     
*修改者:hhx    
*时间:
*修改说明：                    
创建了这个文件
**备注:      
****************************************************************************************/
#include "MyConfig.h"
//#include "sub_c0_demo.h"
//#include "c0_drv.h"
#include "cpm_drv.h"
//#include "delay.h"
//#include "debug.h"
#if  MY_CONFIG_MODULE_EN
#warning MY_CONFIG模块使能!
/*******************************宏定义***************************/  


/*************************.C变量结构声明***********************/  


/*************************私有全局变量*************************/  


/*************************公共全局变量*************************/  
const uint8_t  gRootKey[16][8]={
{0x18,0xd1,0x84,0x4a,0xf3,0x60,0x94,0xcc},/*( 1)*/   //V8/T862/T91P
{0x22,0x06,0x5f,0x9e,0x9d,0xc8,0x9b,0x5c},/*( 2)*/
{0x30,0x07,0x19,0xb0,0xb2,0x2d,0x98,0x0b},/*( 3)*/
{0x6b,0xec,0xc9,0x58,0xa1,0x63,0x9a,0x7b},/*( 4)*/
{0x7e,0x43,0x01,0x95,0x01,0x6c,0x92,0xaa},/*( 5)*/
{0x91,0xd6,0x22,0x84,0xad,0x7d,0x97,0x6a},/*( 6)*/
{0xc8,0x62,0xf9,0xab,0x0f,0xba,0x94,0x49},/*( 7)*/
{0xa1,0x08,0xf0,0xf8,0x93,0x93,0x81,0x89},/*( 8)*/
{0xb1,0x93,0x88,0x88,0x51,0x83,0x81,0x28},/*( 9)*/
{0x7e,0x77,0x72,0xc7,0x8d,0xaf,0x82,0x18},/*(10)*/
{0x22,0x91,0x58,0x0d,0x6f,0xb4,0x74,0x27},/*(11)*/
{0x17,0x73,0x0c,0xb1,0x75,0x2f,0x7f,0x27},/*(12)*/
{0x38,0x68,0x7b,0xb6,0xbe,0xb7,0x75,0xa6},/*(13)*/
{0x41,0x5a,0x20,0x81,0x95,0x13,0x7c,0xd6},/*(14)*/
{0x5d,0x90,0xcd,0xd2,0x61,0x84,0x7a,0x13},/*(15)*/
{0x76,0x80,0x1a,0x79,0xe2,0xf5,0x7d,0x43},/*(16)*/
};



/*************************局部函数*****************************/  




/*************************全局函数****************************/  
/***************************************************************************************
**函数名:       --
**功能描述:     --
**输入参数:     --
**输出参数:     --
**备注:         
****************************************************************************************/
//void Sub_C0_Init(void)
//{
//    CPM->CPM_CHIPCFGR |= (1 << 19);   //enable sub system to main system output isolation
//	CPM->CPM_SYSRSTCR = (1<<22);  //reset M2S_BUS
//	delay(1500);    //delay MUST more than 10us.
//	CPM->CPM_CHIPCFGR &=~ (1 << 19);    //disable sub system to main system output isolation
//	CPM->CPM_SYSRSTCR = 0;    
//	delay(1500);    //delay MUST more than 10us.
//	C0_CPM->CPM_VCCQGTRIMR |= (1 << 30);  //ldo enter lowpower in normal mode, See VDD_SUB 0.9V 
//	
//  C0_WDT->WDT_WCR = 0x0; //Close C0 WDT
//  C0_TC->TCCR = 0x0; //Close C0 TC
//	*((volatile UINT32 *)(0x08146018)) = 0x00c0f000;
//}

#endif  /*MY_CONFIG_MODULE_EN*/
/************************************Code End******************************************/